In [9]:
import pandas as pd
import numpy as np

In [10]:
pd.Series(['a', 'b', 'c'])

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series([2.3, 34.1, 5.0])

0     2.3
1    34.1
2     5.0
dtype: float64

In [12]:
revenues = pd.Series([5555, 7000, 1980])
print(revenues.values)
print(revenues.index)

[5555 7000 1980]
RangeIndex(start=0, stop=3, step=1)

In [15]:
print(revenues[0:3:1])

0    5555
1    7000
2    1980
dtype: int64

In [16]:
city_revenue = pd.Series([4300, 8434, 3342],
                        index=["Bandung", "Jakarta", "Kuningan"])

city_revenue

Bandung     4300
Jakarta     8434
Kuningan    3342
dtype: int64

In [29]:
city_employee_count = pd.Series({"Bandung": 321,
                                "Jakarta" : 121})

In [18]:
city_employee_count.values

array([321, 121, 512], dtype=int64)

In [19]:
city_employee_count.index

Index(['Bandung', 'Jakarta', 'Kuningan'], dtype='object')

In [21]:
"Bandung" in city_employee_count

True

In [30]:
city_data = pd.DataFrame({
    "revenue" : city_revenue,
    "employee_count" : city_employee_count
})

In [31]:
city_data

          revenue  employee_count
Bandung      4300           321.0
Jakarta      8434           121.0
Kuningan     3342             NaN

In [35]:
print(city_data.axes[0])
print(city_data.axes[1])

Index(['Bandung', 'Jakarta', 'Kuningan'], dtype='object')
Index(['revenue', 'employee_count'], dtype='object')

In [44]:
city_data.loc["Bandung" : "Jakarta"]

         revenue  employee_count
Bandung     4300           321.0
Jakarta     8434           121.0

In [46]:
city_data.iloc[0]

revenue           4300.0
employee_count     321.0
Name: Bandung, dtype: float64

In [47]:
city_data.loc["Bandung" : "Kuningan", "employee_count"]

Bandung     321.0
Jakarta     121.0
Kuningan      NaN
Name: employee_count, dtype: float64

In [52]:
further_city_data = pd.DataFrame(
    {"revenue": [3232, 6543], "employee_count": [2, 2]},
    index=["Balikpapan", "Padang"]
)

In [54]:
further_city_data

            revenue  employee_count
Balikpapan     3232               2
Padang         6543               2

In [65]:
city_data

          revenue  employee_count
Bandung      4300           321.0
Jakarta      8434           121.0
Kuningan     3342             NaN

In [64]:
all_city_data = pd.concat([city_data, further_city_data], sort=False)
all_city_data

            revenue  employee_count
Bandung        4300           321.0
Jakarta        8434           121.0
Kuningan       3342             NaN
Balikpapan     3232             2.0
Padang         6543             2.0

In [100]:
city_province = pd.DataFrame({
    "Provinsi": ["Jabar", "DKI_Jakarta","Jabar", "Kalimantan Timur", "Sumatera Selatan"],
    "capital": [1, 1, 0, 1, 1]},
    index=["Bandung", "Jakarta","Kuningan", "Balikpapan", "Padang"]
)

In [101]:
city_province

                    Provinsi  capital
Bandung                Jabar        1
Jakarta          DKI_Jakarta        1
Kuningan               Jabar        0
Balikpapan  Kalimantan Timur        1
Padang      Sumatera Selatan        1

In [102]:
cities = pd.concat([all_city_data, city_province], axis=1, sort=False)
cities

            revenue  employee_count          Provinsi  capital
Bandung        4300           321.0             Jabar        1
Jakarta        8434           121.0       DKI_Jakarta        1
Kuningan       3342             NaN             Jabar        0
Balikpapan     3232             2.0  Kalimantan Timur        1
Padang         6543             2.0  Sumatera Selatan        1

In [129]:
kota = pd.DataFrame({
        "Populatin_millions" : [1, 2.4, 0.4],
        "Pulau" : ["Jawa","Kalimantan", "Sumatera"]
}, index = ["Jabar", "Kalimantan Timur", "Sumatera Selatan"])

In [130]:
kota

                  Populatin_millions       Pulau
Jabar                            1.0        Jawa
Kalimantan Timur                 2.4  Kalimantan
Sumatera Selatan                 0.4    Sumatera

In [131]:
cities

            revenue  employee_count          Provinsi  capital
Bandung        4300           321.0             Jabar        1
Jakarta        8434           121.0       DKI_Jakarta        1
Kuningan       3342             NaN             Jabar        0
Balikpapan     3232             2.0  Kalimantan Timur        1
Padang         6543             2.0  Sumatera Selatan        1

In [132]:
pd.merge(cities, kota, left_on="Provinsi", right_index=True)

,revenue,employee_count,Provinsi,capital,Populatin_millions,Pulau
Bandung,4300,321.0,Jabar,1,1.0,Jawa
Kuningan,3342,NaN,Jabar,0,1.0,Jawa
Balikpapan,3232,2.0,Kalimantan Timur,1,2.4,Kalimantan
Padang,6543,2.0,Sumatera Selatan,1,0.4,Sumatera

In [133]:
pd.merge(cities, kota, left_on="Provinsi", right_index=True, how="left")

,revenue,employee_count,Provinsi,capital,Populatin_millions,Pulau
Bandung,4300,321.0,Jabar,1,1.0,Jawa
Jakarta,8434,121.0,DKI_Jakarta,1,NaN,NaN
Kuningan,3342,NaN,Jabar,0,1.0,Jawa
Balikpapan,3232,2.0,Kalimantan Timur,1,2.4,Kalimantan
Padang,6543,2.0,Sumatera Selatan,1,0.4,Sumatera

In [58]:
dataFrame = pd.DataFrame({"Product": ["SmartTV", "ChromeCast", "Speaker", "Earphone"],
                          "Opening_Stock": [300, 700, 1200, 1500],
                          "Closing_Stock": [200, 500, 1000, 900]})
print("DataFrame...\n",dataFrame)

DataFrame...
       Product  Opening_Stock  Closing_Stock
0     SmartTV            300            200
1  ChromeCast            700            500
2     Speaker           1200           1000
3    Earphone           1500            900

In [60]:

resValues1 = np.where((dataFrame['Opening_Stock']>700) & (dataFrame['Closing_Stock']<1200))
print(" Filtered = \n", dataFrame.loc[resValues1])

 Filtered =
     Product  Opening_Stock  Closing_Stock
2   Speaker           1200           1000
3  Earphone           1500            900